In [1]:
import pandas as pd #라이브러리 호출

In [2]:
data_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data' #Data URL
# data_url = './housing.data' #Data URL
df_data = pd.read_csv(data_url, sep='\s+', header = None) #csv 타입 데이터 로드, separate는 빈공간으로 지정하고, Column은 없음

In [3]:
# 1. 처음 7줄 출력하기
df_data.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

In [1]:
# 2. Column Header 지정하기 
############ = ['CRIM','ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD', 'TAX', 'PTRATIO' ,'B', 'LSTAT', 'MEDV'] 
# 처음 5줄 출력하기

In [ ]:
############ Series

In [5]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [3]:
# 3. 
# (1) list_data series 데이터로 생성하고
# (2) 각각에 a,b,c,d,e 로 인덱스 생성하기
# (3) data type 은 float32
# (4) series 이름은 "example_data" 로 설정

In [4]:
# 4. example_obj의 값 리스트 불러오기

In [5]:
# 5. example_obj의 인덱스 리스트 불러오기

In [6]:
# 6. 
# (1) a~h까지 인덱스를 가지는 Series 생성하기
# (2) a~e의 인덱스에 1~5의 값을 부여

In [ ]:
############ Data Frame

In [10]:
# Example from - https://chrisalbon.com/python/pandas_map_values_to_values.html
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
        'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
        'age': [42, 52, 36, 24, 73],
        'city': ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston']}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city'])
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [7]:
# 7. first_name, last_name 컬럼 호출

In [8]:
# 8. 두가지 방법으로 first_name 컬럼 추출하기

In [9]:
# 9. 1번 row 조회하기 
# (1) 인덱스 이름 활용
# (2) 인덱스 위치 활용

In [10]:
# 10.
# (1) debt 라는 이름의 새로운 컬럼 추가하기
# (2) 값은 연령이 40세 이상이면 True, 미만이면 False 로 설정

In [11]:
# 11. debt 컬럼 삭제하기

In [ ]:
############ Selection & Drop

In [6]:
df = pd.read_excel("./excel-comp-data.xlsx")
df.head()

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [12]:
# 12. Data Frame df에서 "account" 컬럼 한개를 선택하여 상단 3개 row 조회

In [13]:
# 13. Data Frame df에서 "account", "street", "state" 컬럼 세개를 선택하여 상단 3개 row 조회

In [14]:
# 14, 상단 10개 row 선택 (모든 column)

In [15]:
# 15.
# (1) df의 "account" 정보를 account_series라는 series로 생성하기
# (2) account_series의 1, 5, 2 번 row를 조회하기
# (3) 0, 1, 2, 3 row 삭제

In [16]:
# 16. 
# (1) df의 인덱스를 account 값으로 바꾸고 
# (2) account 컬럼 삭제하기
# (3) account 가 211829,320563 인 row의 이름과 주소정보(street)

In [17]:
# 17. 
# (1) 인덱스를 0~14의 값을 갖도록 reindexing

In [19]:
# (2) 1번 row 삭제하기

In [18]:
# (3) 0, 1, 2, 3 row 삭제

In [20]:
# (4) "city" 컬럼 삭제

In [21]:
# (5) "city", "state" 컬럼 삭제하여 data frame에 저장하기 (삭제된 내용으로 저장)

In [ ]:
############## Operation

In [22]:
# 18. s1의 1은 A, 2는 B, 3은 C 값으로 변경하기 (map 사용)

In [71]:
df = pd.read_csv("./wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [23]:
# 19. 인종 정보를 0~9 값의 코드값 생성하기
# (1) df에 어떤 인종 정보가 있는지 조회하기
# (2) 인종 정보가 white > 0, hispanic > 1, black > 2, other > 9 값으로 race_code 컬럼 생성하기

In [86]:
df = pd.read_csv("wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [ ]:
df_info = df[["earn", "height","age"]]
df_info.head()

In [24]:
# 20.
# (1) 시리즈 입력시 시리즈내 최대값과 최소값의 차를 계산하는 함수(f)를 생성 (lambda 사용)
# (2) f 활용하여 dataframe "df_info"의 키와 연령의 range(최대값 - 최소값)를 구하기
# (3) dataframe "df_info"의 키와 연령 합계 생성